wangooi33/WangooSelf_Project/Project_F407/MCSDK/STM32F407_FOC/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "motorcontrol.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define M1_CURR_AMPL_U_Pin GPIO_PIN_6
#define M1_CURR_AMPL_U_GPIO_Port GPIOF
#define M1_CURR_AMPL_V_Pin GPIO_PIN_7
#define M1_CURR_AMPL_V_GPIO_Port GPIOF
#define M1_CURR_AMPL_W_Pin GPIO_PIN_8
#define M1_CURR_AMPL_W_GPIO_Port GPIOF
#define M1_BUS_VOLTAGE_Pin GPIO_PIN_9
#define M1_BUS_VOLTAGE_GPIO_Port GPIOF
#define M1_HALL_H1_Pin GPIO_PIN_10
#define M1_HALL_H1_GPIO_Port GPIOH
#define M1_HALL_H2_Pin GPIO_PIN_11
#define M1_HALL_H2_GPIO_Port GPIOH
#define M1_HALL_H3_Pin GPIO_PIN_12
#define M1_HALL_H3_GPIO_Port GPIOH
#define M1_PWM_UL_Pin GPIO_PIN_13
#define M1_PWM_UL_GPIO_Port GPIOH
#define M1_PWM_VL_Pin GPIO_PIN_14
#define M1_PWM_VL_GPIO_Port GPIOH
#define M1_PWM_WL_Pin GPIO_PIN_15
#define M1_PWM_WL_GPIO_Port GPIOH
#define UART_TX_Pin GPIO_PIN_6
#define UART_TX_GPIO_Port GPIOB
#define UART_RX_Pin GPIO_PIN_7
#define UART_RX_GPIO_Port GPIOB
#define M1_PWM_UH_Pin GPIO_PIN_5
#define M1_PWM_UH_GPIO_Port GPIOI
#define M1_PWM_VH_Pin GPIO_PIN_6
#define M1_PWM_VH_GPIO_Port GPIOI
#define M1_PWM_WH_Pin GPIO_PIN_7
#define M1_PWM_WH_GPIO_Port GPIOI

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
